[{"source": {"id": null, "name": "Inquirer.net"}, "author": "jbalboa", "title": "Charlie Dizon on ‘Viral Scandal’ role: Opened my mind to social issues", "description": "Playing Rica Sicat who got herself embroiled in a sex scandal in “Viral Scandal” has made Charlie Dizon learn hard life lessons.\nThe post Charlie Dizon on ‘Viral Scandal’ role: Opened my mind to social issues appeared first on Inquirer Lifestyle.", "url": "https://lifestyle.inquirer.net/402936/charlie-dizon-on-viral-scandal-role-opened-my-mind-to-social-issues/", "urlToImage": "https://lifestyle.inquirer.net/files/2021/07/charlie-dizon-IG.png", "publishedAt": "2022-05-11T13:10:19Z", "content": "Playing Rica Sicat who got herself embroiled in a sex scandal in Viral Scandal has made Charlie Dizon learn hard life lessons and undergo a major transformation.\r\nI became stronger, mas naging open y… [+1667 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "jbalboa", "title": "Bernadette Sembrano on caring for plants: Whether your love is accepted or not, what’s important is you loved", "description": "Bernadette Sembrano admits she is not gifted with a green thumb and that she is a hit-or-miss when it comes to keeping her plants stay alive.\nThe post Bernadette Sembrano on caring for plants: Whether your love is accepted or not, what’s important is you love…", "url": "https://lifestyle.inquirer.net/402899/bernadette-sembrano-on-caring-for-plants-whether-your-love-is-accepted-or-not-whats-important-is-you-loved/", "urlToImage": "https://lifestyle.inquirer.net/files/2021/07/sembrano-ig.png", "publishedAt": "2022-05-11T12:14:43Z", "content": "Broadcaster Bernadette Sembrano admits she is not gifted with a green thumb and she feels that she is a hit-or-miss when it comes to keeping her plants stay alive.\r\nSembrano shared her planting exper… [+1406 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Benjo Diaz", "title": "Il Primo unveils prime dining in NUSTAR", "description": "The first and only Italian Steakhouse in Cebu opens in NUSTAR Resort and Casino – ushering in an authentic Italian dining experience in the Island of New Possibilities. Located at ‘The Strip’ in NUSTAR, Il Primo is the first restaurant to open in the Integrat…", "url": "https://lifestyle.inquirer.net/402895/il-primo-unveils-prime-dining-in-nustar/", "urlToImage": "https://lifestyle.inquirer.net/files/2022/05/Screen-Shot-2022-05-11-at-5.14.31-PM.png", "publishedAt": "2022-05-11T09:09:22Z", "content": "The first and only Italian Steakhouse in Cebu opens in NUSTAR Resort and Casino ushering in an authentic Italian dining experience in the Island of New Possibilities.\r\nLocated at The Strip in NUSTAR,… [+2602 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Benjo Diaz", "title": "Classic Filipino favorites at Fina Restaurant in NUSTAR", "description": "Derived from the word ‘Filipiniana’, Fina will be the destination restaurant for the best Filipino specialties from Cebu and other regions of the country, punctuated by the promise of an authentic Filipino dining experience. Fina’s menu collection of well-kno…", "url": "https://lifestyle.inquirer.net/402891/classic-filipino-favorites-at-fina-restaurant-in-nustar/", "urlToImage": "https://lifestyle.inquirer.net/files/2022/05/Fina-Interior-.jpg", "publishedAt": "2022-05-11T09:03:17Z", "content": "Derived from the word Filipiniana, Fina will be the destination restaurant for the best Filipino specialties from Cebu and other regions of the country, punctuated by the promise of an authentic Fili… [+1403 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "vcatibog", "title": "Trendsetting furniture unmasked by Interior Designers at KARE and PIID’s MasKAREde Ball", "description": "It was a night of revelry and elegance as home furnishing leader, KARE, and the Philippine Institute of Interior Designers (PIID) welcomed home designers, influencers, and the media, to a masquerade ball at the KARE showroom in The Podium, Ortigas on April 28…", "url": "https://lifestyle.inquirer.net/402878/trendsetting-furniture-unmasked-by-interior-designers-at-kare-and-piids-maskarede-ball/", "urlToImage": "https://lifestyle.inquirer.net/files/2022/05/Photo-1_with-caption.jpg", "publishedAt": "2022-05-11T05:53:32Z", "content": "It was a night of revelry and elegance as home furnishing leader, KARE, and the Philippine Institute of Interior Designers (PIID) welcomed home designers, influencers, and the media, to a masquerade … [+1871 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Hotaru Niitsu", "title": "﻿Shop till you drop while enjoying up to 50% off on 10,000 products at Watsons Big Nationwide Sale", "description": "You’re counting down the days to pay day. Being an adept and seasoned practitioner of the art of adulting, you’ve got your food and basic necessities already covered.  What’ll be left off of your coming salary will be all yours to splurge.  You just cross you…", "url": "https://lifestyle.inquirer.net/402871/shop-till-you-drop-while-enjoying-up-to-50-off-on-10000-products-at-watsons-big-nationwide-sale/", "urlToImage": "https://lifestyle.inquirer.net/files/2022/05/Watsons-Big-NWS-3-scaled.jpg", "publishedAt": "2022-05-11T03:00:37Z", "content": "Youre counting down the days to pay day. Being an adept and seasoned practitioner of the art of adulting, youve got your food and basic necessities already covered.  Whatll be left off of your coming… [+1760 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "jbalboa", "title": "Daniel Padilla credits teleseryes for promoting Filipino culture abroad", "description": "For Kapamilya actor Daniel Padilla, watching Filipino films and soap operas is one way of preserving the culture of Filipinos.\nThe post Daniel Padilla credits teleseryes for promoting Filipino culture abroad appeared first on Inquirer Lifestyle.", "url": "https://lifestyle.inquirer.net/402868/daniel-padilla-credits-teleseryes-for-promoting-filipino-culture-abroad/", "urlToImage": "https://lifestyle.inquirer.net/files/2020/08/daniel-padilla-ig.png", "publishedAt": "2022-05-10T12:37:53Z", "content": "For Kapamilya actor Daniel Padilla, watching Filipino films and soap operas is one way of preserving the culture of Filipinos.\r\nPadilla stressed the importance of knowing what Filipino culture is all… [+2952 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "jbalboa", "title": "John Estrada has a plea to politicians", "description": "John Estrada was sorry to see the voting public queuing in long lines and suffering from the scorching heat.\nThe post John Estrada has a plea to politicians appeared first on Inquirer Lifestyle.", "url": "https://lifestyle.inquirer.net/402865/john-estrada-has-a-plea-to-politicians/", "urlToImage": "https://lifestyle.inquirer.net/files/2022/05/john-estrada-ig.png", "publishedAt": "2022-05-10T11:24:02Z", "content": "Actor John Estrada made a plea to those seeking public office after casting his vote yesterday.\r\nEstrada is asking elected public officials to be responsible after being elected into office, as shown… [+1649 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Hotaru Niitsu", "title": "Complete the #MissingHalf by giving your child M-F-G-M", "description": "For a long period, moms believed that IQ and physical well-being are the only major aspects of child development. They believed that fostering the body and nurturing logic, memory and language hold the key to attaining the ideal, balanced and complete body an…", "url": "https://lifestyle.inquirer.net/402829/complete-the-missinghalf-by-giving-your-child-m-f-g-m/", "urlToImage": "https://lifestyle.inquirer.net/files/2022/05/MGM01959-scaled.jpg", "publishedAt": "2022-05-10T09:06:58Z", "content": "For a long period, moms believed that IQ and physical well-being are the only major aspects of child development. They believed that fostering the body and nurturing logic, memory and language hold t… [+2633 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "vcatibog", "title": "Survey reveals delayed diagnosis, heavy disease burden among Filipinos with axial spondyloarthritis", "description": "On average, Filipinos with axial spondyloarthritis (axSpA) are diagnosed 5.8 years after developing the disease. axSpA has a significant functional, psychosocial and economic impact on patients, highlighting the heavy disease burden of axSpA. These are among …", "url": "https://lifestyle.inquirer.net/402801/survey-reveals-delayed-diagnosis-heavy-disease-burden-among-filipinos-with-axial-spondyloarthritis/", "urlToImage": "https://lifestyle.inquirer.net/files/2022/05/C7EB6F07-FAAC-4409-82AA-994E0194EE39-1.jpg", "publishedAt": "2022-05-10T04:26:39Z", "content": "On average, Filipinos with axial spondyloarthritis (axSpA) are diagnosed 5.8 years after developing the disease. axSpA has a significant functional, psychosocial and economic impact on patients, high… [+6377 chars]"}]